import re
with open ('anna.txt', 'r', encoding = 'utf-8') as f:
    text = f.read().replace('\n', '').lower()
    words = text.split()
    verb = '[отркрыть|открыться|открываю|открываем|открываешь|открываете|открывает|открывают|открыл|открыли|открыла|открыло|открыли|открою|откроем|откроешь|откроете|откроет|откроют|открывающий|открывающая|открывающее|открывающие|открывший|открывшая|открывшее|открывшие|открываемый|открываемые|открытый|открытые|открой|откройте]'
    for word in words:
        m = re.search(verb, word)
        if m != None:
            print (word)


#отркрыть
#открыться
#открываю
#открываем
#открываешь
#открываете
#открывает
#открывают
#открыл
#открыли
#открыла
#открыло
#открыли
#открою
#откроем
#откроешь
#откроете
#откроет
#откроют
#открывающий
#открывающая
#открывающее
#открывающие
#открывший
#открывшая
#открывшее
#открывшие
#открыаемый
#открываемые
#открытый
#открытые
#открой
#откройте

